app/Views/home/admission.php

$hjr = new Hijri();
$set = new Setting();

$admission = $set->where('name', 'registration')->first();
---
SELECT *
FROM `settings`
WHERE `name` = 'registration'
 LIMIT 1