app/Views/home/contact.php

SELECT *
FROM `settings`
WHERE `name` = 'email'
 LIMIT 1
---

$set = new Setting();

$email = $set->where('name', 'email')->first();