app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'student'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `fn` = 'teacher'
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT *
FROM `settings`
WHERE `name` = 'room'
AND `link` IS NOT NULL
SELECT *
FROM `attendances`
WHERE `status` = 0
AND `reason` IS NOT NULL
AND `file` IS NOT NULL
AND `reply` IS NULL
---
    public function index()
    {
        $usr = new User();
        $att = new Attendance();
        $set = new Setting();

        $data['title'] = lang('app.dashboard');
        $data['students'] = $usr->where('role', 'student')->countAllResults();
        $data['teachers'] = $usr->where('fn', 'teacher')->countAllResults();
        $data['user'] = $usr->find(session('id'));
        $data['rooms'] = $set->where(['name' => 'room', 'link!=' => null])->findAll();
        $data['attendance'] = $att->where(['status' => 0, 'reason!=' => null, 'file!=' => null, 'reply' => null])->findAll();