app/Controllers/AuthController.php

    public function auth()
    {
        // dd($this->request->getVar());

        $session = session();
        $user = new User();
        $act = new ActivityLog();

        $identity = $this->request->getVar('identity');
        $password = $this->request->getVar('password');
        $data = $user->where('username', $identity)->orWhere('email', $identity)->orWhere('phone', $identity)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'B2401060000'
OR `email` = 'B2401060000'
OR `phone` = 'B2401060000'
 LIMIT 1