app/Models/ActivityLog.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
INSERT INTO `activity_logs` (`user_id`, `role`, `name`, `email`, `activity`, `info`) VALUES ('1', 'admin', 'SUPER ADMIN', 'admin@gmail.com', 'Log In - Authentication', 'User was Logged In Successfully!')
---
    function addActivity($id, $activity, $info)
    {
        $usr = new User();
        $act = new ActivityLog();

        $user = $usr->find($id);

        $dt = [
            'user_id' => $id,
            'role' => $user['role'],
            'name' => $user['name'] . ' ' . $user['lname'],
            'email' => $user['email'],
            'activity' => $activity,
            'info' => $info,
        ];

        $act->insert($dt);